app/controllers/logins_controller.rb

  def login
  	if request.post?
  		if Usuario.find_by_usuario_and_senha(params[:nome], params[:senha])
---
SELECT * FROM "usuarios" WHERE ("usuarios"."senha" = 'seila12' AND "usuarios"."usuario" = 'thiago') LIMIT 1