app/controllers/usuarios_controller.rb

  def index
  	if request.post?
  		@usuarios = Usuario.find(:dadosUsuario)
---
SELECT * FROM "usuarios" WHERE ("usuarios"."id" IS NULL) LIMIT 1